{
	"tenures": [
		"less than one year",
		"one to two years",
		"two to three years",
		"three to four years",
		"four to five years",
		"five to six years",
		"more than six years"
	],
	"fields": [
		{
			"name": "Engineering",
			"descriptor": "an engineer",
			"roles": [
				{
					"name": "Front End Engineer",
					"levels": [
						{
							"title": "Front End Engineer I",
							"description": "A level I front end engineer is just beginning their professional career in front end software engineering and is working toward a strong foundational knowledge of the fundamentals.",
							"startingSalary": 85000,
							"annualRaises": [0.1]
						},
						{
							"title": "Front End Engineer II",
							"description": "A level II front end engineer has relevant professional experience and a solid understanding of front end engineering fundamentals. They require less direction to accomplish tasks.",
							"startingSalary": 95000,
							"annualRaises": [0.075, 0.05, 0.03, 0.025, 0.02, 0.02]
						},
						{
							"title": "Lead Front End Engineer",
							"description": "A lead front end engineer is a highly experienced individual contributor whoʼs been given leadership responsibilities. Lead engineers generally have others reporting to them and have more input over the design and direction of the product.",
							"startingSalary": 110000,
							"annualRaises": [0.05, 0.035, 0.03, 0.025, 0.02, 0.02]
						}
					]
				},
				{
					"name": "Back End Engineer",
					"levels": [
						{
							"title": "Back End Engineer I",
							"description": "A level I back end engineer is just beginning their professional career in back end software engineering and is working toward a strong foundational knowledge of the fundamentals.",
							"startingSalary": 77500,
							"annualRaises": [0.1]
						},
						{
							"title": "Back End Engineer II",
							"description": "A level II back end engineer has relevant professional experience and a solid understanding of back end engineering fundamentals. They require less direction to accomplish tasks.",
							"startingSalary": 87500,
							"annualRaises": [0.075, 0.05, 0.03, 0.025, 0.02, 0.02]
						},
						{
							"title": "Lead Back End Engineer",
							"description": "A lead back end engineer is a highly experienced individual contributor whoʼs been given leadership responsibilities. Lead engineers generally have others reporting to them and have more input over the design and direction of the product.",
							"startingSalary": 102500,
							"annualRaises": [0.05, 0.035, 0.03, 0.025, 0.02, 0.02]
						}
					]
				}
			]
		},
		{
			"name": "Customer Success",
			"descriptor": "in customer success",
			"roles": [
				{
					"name": "Customer Success Champion",
					"levels": [
						{
							"title": "Customer Success Champion I",
							"description": "A level I customer success champion has relevant work experience in customer service oriented roles, is a strong communicator, and is very personable.",
							"startingSalary": 45000,
							"annualRaises": [0.1]
						},
						{
							"title": "Customer Success Champion II",
							"description": "A level II customer success champion has extensive work experience in customer success roles, has excellent communication skills, is very personable, and has a strong grasp of technology.",
							"startingSalary": 49000,
							"annualRaises": [0.075, 0.05, 0.03, 0.025, 0.02, 0.02]
						},
						{
							"title": "Lead Customer Success Champion",
							"description": "A lead customer success champion is as talented as a level II customer success champion, but also has leadership responsibilities. Among other things, this includes reviewing the performance of others who report to them, taking an active role in the hiring process, and ensuring team goals are achieved.",
							"startingSalary": 54500,
							"annualRaises": [0.05, 0.035, 0.03, 0.025, 0.02, 0.02]
						}
					]
				}
			]
		}
	]
}
