{
	"tenures": [
		"less than one year",
		"one to two years",
		"two to three years",
		"three to four years",
		"four to five years",
		"five to six years",
		"six to seven years",
		"seven to eight years",
		"more than eight years"
	],
	"fields": [
		{
			"name": "Engineering",
			"descriptor": "an engineer",
			"roles": [
				{
					"levels": [
						{
							"title": "Front End Engineer I",
							"description": "A level one front end engineer is usually just beginning their professional career in front end software engineering and is developing a strong foundational knowledge of the fundamentals and familiarity with the technologies they use. They’re capable of completing tasks given to them with some direction and oversight. Reviews typically require more iterations to achieve high quality, intuitive, and polished code contributions. They are still internalizing both industry and internal best practices and conventions.",
							"startingSalary": 88000,
							"annualRaises": [0.1]
						},
						{
							"title": "Front End Engineer II",
							"description": "A level two front end engineer has relevant professional experience and has developed a strong understanding of software engineering fundamentals. They have a stronger grasp of both industry and internal best practices and conventions. They require less direction to accomplish tasks and are beginning to take more initiative to propose contributions and design solutions to problems. Reviews generally require fewer iterations before being accepted. Level two engineers have grown in efficiency and can tackle more complex problems with less direction. Their expertise with browser technologies, performance measuring, accessibility testing, and other front end specific knowledge is expanding. Their eye for UI/UX is developing as they learn how to refine the front end experiences they produce.",
							"startingSalary": 95500,
							"annualRaises": [0.075, 0.05, 0.03]
						},
						{
							"title": "Front End Engineer III",
							"description": "A level three front end engineer typically has several years of relevant professional experience and has honed their skills on a wide variety of topics related to front end engineering. They have a solid understanding of software engineering fundamentals and are beginning to be seen as a knowledge source by their teammates. They’ve developed an instinctive ability to follow best practices and conventions. Little direction is needed to accomplish tasks and they can tackle changes efficiently. The code they contribute is effective and well written, requiring very few review iterations. They often propose contributions and can effectively design solutions to more complex problems. They are well experienced with browser technologies, performance measuring, and accessibility testing, among other front end knowledge areas. They have an eye for UI/UX and are talented at refining the front end experiences they produce.",
							"startingSalary": 105500,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						},
						{
							"title": "Senior Front End Engineer",
							"description": "A senior front end engineer—the first step on the contributor track—is a talented and efficient individual contributor with substantial professional experience. They produce effective, intuitive, and polished code contributions that require little-to-no review iterations. Given their deep familiarity with the technologies they use, they are seen as a technical guru by their teammates. They are often trusted to design skillful solutions to complex problems and dependably propose contributions.",
							"startingSalary": 115500,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						},
						{
							"title": "Lead Front End Engineer",
							"description": "A lead front end engineer—the first step on the leadership track—is a highly experienced front end engineer with a knack for producing great work in others. While also being a strong individual contributor, lead engineers are beginning to incorporate leadership responsibilities into their role, like reviewing their teammates’ contributions, assigning tasks, and directing smaller projects. They assist with hiring and training new team members and provide guidance to less experienced teammates.",
							"startingSalary": 115500,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						}
					]
				},
				{
					"levels": [
						{
							"title": "Back End Engineer I",
							"description": "A level one back end engineer is usually just beginning their professional career in back end software engineering and is developing a strong foundational knowledge of the fundamentals and familiarity with the technologies they use. They’re capable of completing tasks given to them with some direction and oversight. Reviews typically require more iterations to achieve high quality, intuitive, and polished code contributions. They are still internalizing both industry and internal best practices and conventions.",
							"startingSalary": 80500,
							"annualRaises": [0.1]
						},
						{
							"title": "Back End Engineer II",
							"description": "A level two back end engineer has relevant professional experience and has developed a strong understanding of software engineering fundamentals. They have a stronger grasp of both industry and internal best practices and conventions. They require less direction to accomplish tasks and are beginning to take more initiative to propose contributions and design solutions to problems. Reviews generally require fewer iterations before being accepted. Level two engineers have grown in efficiency and can tackle more complex problems with less direction. Their expertise with network requests, database design, microservice design, performance optimizations, and other back end specific knowledge is expanding.",
							"startingSalary": 88000,
							"annualRaises": [0.075, 0.05, 0.03]
						},
						{
							"title": "Back End Engineer III",
							"description": "A level three back end engineer typically has several years of relevant professional experience and has honed their skills on a wide variety of topics related to back end engineering. They have a solid understanding of software engineering fundamentals and are beginning to be seen as a knowledge source by their teammates. They’ve developed an instinctive ability to follow best practices and conventions. Little direction is needed to accomplish tasks and they can tackle changes efficiently. The code they contribute is effective and well written, requiring very few review iterations. They often propose contributions and can effectively design solutions to more complex problems. They are well experienced with network requests, database design, microservice design, and performance optimizations, among other back end knowledge areas.",
							"startingSalary": 98000,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						},
						{
							"title": "Senior Back End Engineer",
							"description": "A senior back end engineer—the first step on the contributor track—is a talented and efficient individual contributor with substantial professional experience. They produce effective, intuitive, and polished code contributions that require little-to-no review iterations. Given their deep familiarity with the technologies they use, they are seen as a technical guru by their teammates. They are often trusted to design skillful solutions to complex problems and dependably propose contributions.",
							"startingSalary": 108000,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						},
						{
							"title": "Lead Back End Engineer",
							"description": "A lead back end engineer—the first step on the leadership track—is a highly experienced back end engineer with a knack for producing great work in others. While also being a strong individual contributor, lead engineers are beginning to incorporate leadership responsibilities into their role, like reviewing their teammates’ contributions, assigning tasks, and directing smaller projects. They assist with hiring and training new team members and provide guidance to less experienced teammates.",
							"startingSalary": 108000,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						}
					]
				},
				{
					"levels": [
						{
							"title": "Mobile Engineer I",
							"description": "A level one mobile engineer is usually just beginning their professional career in mobile software engineering and is developing a strong foundational knowledge of the fundamentals and familiarity with the technologies they use. They’re capable of completing tasks given to them with some direction and oversight. Reviews typically require more iterations to achieve high quality, intuitive, and polished code contributions. They are still internalizing both industry and internal best practices and conventions.",
							"startingSalary": 85000,
							"annualRaises": [0.1]
						},
						{
							"title": "Mobile Engineer II",
							"description": "A level two mobile engineer has relevant professional experience and has developed a strong understanding of software engineering fundamentals. They have a stronger grasp of both industry and internal best practices and conventions. They require less direction to accomplish tasks and are beginning to take more initiative to propose contributions and design solutions to problems. Reviews generally require fewer iterations before being accepted. Level two engineers have grown in efficiency and can tackle more complex problems with less direction. Their expertise with mobile operating systems, network requests, performance measuring, platform guidelines, database design, and other mobile specific knowledge is expanding. Their eye for UI/UX is developing as they learn how to refine the user experiences they produce.",
							"startingSalary": 92500,
							"annualRaises": [0.075, 0.05, 0.03]
						},
						{
							"title": "Mobile Engineer III",
							"description": "A level three mobile engineer typically has several years of relevant professional experience and has honed their skills on a wide variety of topics related to mobile engineering. They have a solid understanding of software engineering fundamentals and are beginning to be seen as a knowledge source by their teammates. They’ve developed an instinctive ability to follow best practices and conventions. Little direction is needed to accomplish tasks and they can tackle changes efficiently. The code they contribute is effective and well written, requiring very few review iterations. They often propose contributions and can effectively design solutions to more complex problems. They are well experienced with mobile operating systems, network requests, performance measuring, platform guidelines, and database design, among other mobile development knowledge areas. They have an eye for UI/UX and are talented at refining the user experiences they produce.",
							"startingSalary": 102500,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						},
						{
							"title": "Senior Mobile Engineer",
							"description": "A senior mobile engineer—the first step on the contributor track—is a talented and efficient individual contributor with substantial professional experience. They produce effective, intuitive, and polished code contributions that require little-to-no review iterations. Given their deep familiarity with the technologies they use, they are seen as a technical guru by their teammates. They are often trusted to design skillful solutions to complex problems and dependably propose contributions.",
							"startingSalary": 112500,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						},
						{
							"title": "Lead Mobile Engineer",
							"description": "A lead mobile engineer—the first step on the leadership track—is a highly experienced mobile engineer with a knack for producing great work in others. While also being a strong individual contributor, lead engineers are beginning to incorporate leadership responsibilities into their role, like reviewing their teammates’ contributions, assigning tasks, and directing smaller projects. They assist with hiring and training new team members and provide guidance to less experienced teammates.",
							"startingSalary": 112500,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						}
					]
				},
				{
					"levels": [
						{
							"title": "DevOps Engineer I",
							"description": "A level one DevOps engineer is usually just beginning their professional career in DevOps software engineering and is developing a strong foundational knowledge of the fundamentals and familiarity with the technologies they use. They’re capable of completing tasks given to them with some direction and oversight. Reviews typically require more iterations to achieve high quality, intuitive, and polished code contributions. They are still internalizing both industry and internal best practices and conventions.",
							"startingSalary": 85500,
							"annualRaises": [0.1]
						},
						{
							"title": "DevOps Engineer II",
							"description": "A level two DevOps engineer has relevant professional experience and has developed a strong understanding of software engineering fundamentals. They have a stronger grasp of both industry and internal best practices and conventions. They require less direction to accomplish tasks and are beginning to take more initiative to propose contributions and design solutions to problems. Reviews generally require fewer iterations before being accepted. Level two engineers have grown in efficiency and can tackle more complex problems with less direction. Their expertise with Kubernetes, CI/CD pipelines, CLI design, performance optimizations, and other DevOps specific knowledge is expanding.",
							"startingSalary": 93000,
							"annualRaises": [0.075, 0.05, 0.03]
						},
						{
							"title": "DevOps Engineer III",
							"description": "A level three DevOps engineer typically has several years of relevant professional experience and has honed their skills on a wide variety of topics related to DevOps engineering. They have a solid understanding of software engineering fundamentals and are beginning to be seen as a knowledge source by their teammates. They’ve developed an instinctive ability to follow best practices and conventions. Little direction is needed to accomplish tasks and they can tackle changes efficiently. The code they contribute is effective and well written, requiring very few review iterations. They often propose contributions and can effectively design solutions to more complex problems. They are well experienced with Kubernetes, CI/CD pipelines, CLI design, and performance optimizations, among other DevOps knowledge areas.",
							"startingSalary": 103000,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						},
						{
							"title": "Senior DevOps Engineer",
							"description": "A senior DevOps engineer—the first step on the contributor track—is a talented and efficient individual contributor with substantial professional experience. They produce effective, intuitive, and polished code contributions that require little-to-no review iterations. Given their deep familiarity with the technologies they use, they are seen as a technical guru by their teammates. They are often trusted to design skillful solutions to complex problems and dependably propose contributions.",
							"startingSalary": 113000,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						},
						{
							"title": "Lead DevOps Engineer",
							"description": "A lead DevOps engineer—the first step on the leadership track—is a highly experienced DevOps engineer with a knack for producing great work in others. While also being a strong individual contributor, lead engineers are beginning to incorporate leadership responsibilities into their role, like reviewing their teammates’ contributions, assigning tasks, and directing smaller projects. They assist with hiring and training new team members and provide guidance to less experienced teammates.",
							"startingSalary": 113000,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						}
					]
				},
				{
					"levels": [
						{
							"title": "Software Engineering Manager",
							"description": "A software engineering manager is talented at managing other software engineers and empowering them to produce their best work. They’re deeply familiar with both industry and internal best practices and conventions, and use that knowledge to provide invaluable guidance and feedback to the engineers on their team. They have excellent communication skills and are able to clearly convey technical concepts. Among other responsibilities, a software engineering manager is responsible for reviewing code contributions, documenting designs, distributing and prioritizing workload, mentoring their team, and helping with hiring and training.",
							"startingSalary": 150000,
							"annualRaises": [
								0.03, 0.0275, 0.025, 0.0225, 0.02, 0.02, 0.015, 0.015
							]
						}
					]
				}
			]
		},
		{
			"name": "Customer Success",
			"descriptor": "in customer success",
			"roles": [
				{
					"levels": [
						{
							"title": "Customer Success Champion I",
							"description": "A level one customer success champion has relevant work experience in customer service oriented roles, is a strong communicator, and is personable. They’re tech-savvy enough to understand new technologies quickly and are developing a familiarity with the product and technologies used. They’re capable of interacting with customers and completing work with some direction and oversight, with some review needed to achieve high quality output.",
							"startingSalary": 48000,
							"annualRaises": [0.1]
						},
						{
							"title": "Customer Success Champion II",
							"description": "A level two customer success champion has extensive work experience in customer success roles, excellent communication skills, and is exceedingly personable. Their understanding and familiarity of the product and technologies used are expanding, and they can tackle more complex situations with less direction. Their work has grown in efficiency and typically requires fewer modifications to meet our team’s high standards of quality. Level two customer success champions also are beginning to take more initiative to solve problems, help other members, and propose new ideas.",
							"startingSalary": 52000,
							"annualRaises": [
								0.075, 0.05, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						},
						{
							"title": "Senior Customer Success Champion",
							"description": "A senior customer success champion—the first step on the contributor track—is a talented individual contributor with substantial professional experience. They have a deep familiarity with the product and technologies used and are viewed as an expert by their team. Their work is efficient and high quality, requiring little-to-no review. They help guide less experienced team members, develop content, and are trusted to solve complex problems.",
							"startingSalary": 60000,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						},
						{
							"title": "Lead Customer Success Champion",
							"description": "A lead customer success champion—the first step on the leadership track—is highly experienced and has a knack for producing great work in others. While being a strong individual contributor, they also have leadership responsibilities. Among other things, this includes reviewing the performance of those who report to them, assisting with hiring and training new team members, providing guidance, and ensuring team goals are achieved.",
							"startingSalary": 60000,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						}
					]
				},
				{
					"levels": [
						{
							"title": "Head of Customer Success",
							"description": "A head of customer success is responsible for leading the customer success team for one company in the Sparksuite family. They have a wealth of customer success knowledge and experience, and are responsible for designing the systems and frameworks employed by their team. They track the overall team performance and set the bigger-picture goals for ensuring customers are as successful as possible using our product. Among other responsibilities, a head of customer success is responsible for making hiring decisions, working on special projects, helping navigate more complex customer inquiries, aggregating feedback received through customer success channels, and collaborating with other team heads.",
							"startingSalary": 90000,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						}
					]
				}
			]
		},
		{
			"name": "People Ops",
			"descriptor": "in people ops",
			"roles": [
				{
					"levels": [
						{
							"title": "People Ops Generalist",
							"description": "A people ops generalist is responsible for and passionate about creating an exceptional experience for current and prospective team members. Among a variety of responsibilities, they help attract and onboard talented team members by overseeing hiring, onboarding, and training; they promote our goals of transparency, clarity, and flexibility with our policies and benefits; they foster company culture by coordinating team outings, events, and activities; they ensure compliance with employment laws; and they support managers as they lead their teams. A people ops generalist has the knowledge and experience to accomplish these responsibilities and possesses the ability to communicate clearly and effectively.",
							"startingSalary": 75000,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						}
					]
				}
			]
		},
		{
			"name": "Administration",
			"descriptor": "in administration",
			"roles": [
				{
					"levels": [
						{
							"title": "Office Assistant",
							"description": "An office assistant is responsible for keeping our office running smoothly through a myriad of responsibilities. They have experience supporting a team in an office setting, and they have exposure to a variety of office-based duties. They play an integral part in keeping the office an enjoyable space by ensuring office supplies are stocked and orderly; checking and distributing mail appropriately; and maintaining equipment throughout. The office assistant has a hand in fostering positive company culture by helping plan and organize company events, replenishing the break room, and performing other duties that set the team up for success. They are reliable, dependable, and capable of performing their tasks in a timely fashion with limited oversight. They are friendly, approachable, and eager to collaborate with their teammates.",
							"startingSalary": 17500,
							"annualRaises": [
								0.05, 0.035, 0.03, 0.025, 0.02, 0.02, 0.015, 0.015
							]
						}
					]
				}
			]
		}
	]
}
